<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Factories\HasFactory;
use Illuminate\Database\Eloquent\Model;

class Blog extends Model
{
    use HasFactory;

    protected static $blogs;

    public static function allBlogs ()
    {
        return [
            0 => [
                'id' => 1,
                'category_id' => 1,
                'title' => 'নির্বাচন কমিশন গঠনে ভারতীয় সুপ্রিম কোর্টের যুগান্তকারী রায়',
                'image' => 'news-1.webp',
                'short_description' => 'সচরাচর দেখা যায়, সরকারের অনুগত ও ঘনিষ্ঠ আমলাদেরই এই পদে নিযুক্তি দেওয়া হয়।',
                'long_description' => 'এবার থেকে ভারতের মুখ্য নির্বাচন কমিশনার ও দুই নির্বাচন কমিশনারের নিযুক্তিতে প্রধানমন্ত্রীর সঙ্গে অংশ নেবেন সুপ্রিম কোর্টের প্রধান বিচারপতি ও লোকসভার বিরোধী দলের নেতা।

সুপ্রিম কোর্টের বিচারপতি কে এম যোসেফের নেতৃত্বাধীন পাঁচ সদস্যের সাংবিধানিক বেঞ্চ আজ বৃহস্পতিবার এই ঐতিহাসিক রায় দিয়েছেন। এই বিষয়ে কেন্দ্রকে উপযুক্ত আইন প্রণয়নের নির্দেশ দেওয়া হয়েছে। তা না হওয়া পর্যন্ত সর্বোচ্চ আদালতের বেঁধে দেওয়া এই নতুন বিধি চালু থাকবে বলে রায়ে জানানো হয়েছে।'
            ],
            1 => [
                 'id' => 2,
                'category_id' => 1,
                'title' => 'ঢাবির প্রক্টরিয়াল টিমের বিরুদ্ধে বছরে অর্ধকোটি টাকা চাঁদাবাজির অভিযোগ, তদন্তে কমিটি',
                'image' => 'news-2.webp',
                'short_description' => 'ঢাকা বিশ্ববিদ্যালয়ের (ঢাবি) প্রক্টরিয়াল টিমের বিরুদ্ধে ক্যাম্পাসসহ আশপাশের এলাকায় অবৈধ ভ্রাম্যমাণ দোকান বসিয়ে বছরে প্রায় অর্ধকোটি টাকা চাঁদাবাজির অভিযোগ উঠেছে। এই অভিযোগ তদন্তে তিন সদস্যের কমিটি করেছে বিশ্ববিদ্যালয় কর্তৃপক্ষ।',
                'long_description' => 'ঢাকা বিশ্ববিদ্যালয়ের (ঢাবি) প্রক্টরিয়াল টিমের বিরুদ্ধে ক্যাম্পাসসহ আশপাশের এলাকায় অবৈধ ভ্রাম্যমাণ দোকান বসিয়ে বছরে প্রায় অর্ধকোটি টাকা চাঁদাবাজির অভিযোগ উঠেছে। এই অভিযোগ তদন্তে তিন সদস্যের কমিটি করেছে বিশ্ববিদ্যালয় কর্তৃপক্ষ।

আজ বৃহস্পতিবার বিশ্ববিদ্যালয়ের জনসংযোগ দপ্তর থেকে পাঠানো এক সংবাদ বিজ্ঞপ্তিতে এই তদন্ত কমিটি গঠনের কথা জানানো হয়েছে। কমিটিকে দুই সপ্তাহের মধ্যে প্রতিবেদন দিতে বলা হয়েছে।'
            ],
            2 => [
                 'id' => 3,
                'category_id' => 2,
                'title' => 'ওএমএসের ট্রাক থেকে চাল নিতে এসে জ্ঞান হারালেন গোলাম মোস্তফা',
                'image' => 'news-3.webp',
                'short_description' => 'মিরপুর ১২ নম্বর সেকশনে সিটি ক্লাব মাঠসংলগ্ন সড়কে আজ বৃহস্পতিবার সকালে খোলাবাজারে চাল-আটা বিক্রির (ওএমএস) ট্রাকের লাইনে দাঁড়িয়ে ছিলেন একটি বাড়ির নিরাপত্তারক্ষী গোলাম মোস্তফা খান। তিনি যখন লাইনে দাঁড়ান, তখন সকাল নয়টার মতো বাজে।',
                'long_description' => 'মিরপুর ১২ নম্বর সেকশনে সিটি ক্লাব মাঠসংলগ্ন সড়কে আজ বৃহস্পতিবার সকালে খোলাবাজারে চাল-আটা বিক্রির (ওএমএস) ট্রাকের লাইনে দাঁড়িয়ে ছিলেন একটি বাড়ির নিরাপত্তারক্ষী গোলাম মোস্তফা খান। তিনি যখন লাইনে দাঁড়ান, তখন সকাল নয়টার মতো বাজে।

দীর্ঘ সময় লাইনে দাঁড়িয়ে থাকতে সমস্যা হলেও কষ্টে পাওয়া সিরিয়াল ছেড়ে দূরে সরতে পারছিলেন না গোলাম মোস্তফা। একপর্যায়ে বেলা ১১টার দিকে লাইনের পাশেই অজ্ঞান হয়ে পড়ে যান তিনি।'
            ],
            3 => [
                 'id' => 4,
                'category_id' => 2,
                'title' => 'কাজাখস্তানের তেল কিনছে জার্মানি, লাভ হচ্ছে রাশিয়ার',
                'image' => 'news-4.webp',
                'short_description' => 'গত বছরের ২৪ ফেব্রুয়ারির রাশিয়া ও ইউক্রেন যুদ্ধের পর রাশিয়ার তেল আর কিনছে না জার্মানি। তারা এখন তেল নিচ্ছে বর্তমান মধ্য এশিয়া ও সাবেক সোভিয়েত ইউনিয়নের দেশ কাজাখস্তান থেকে। চলতি সপ্তাহেই দ্রুঝবা পাইপলাইন দিয়ে জার্মানিতে তেল পাঠিয়েছে কাজাখস্তান। কাজাখস্তান থেকে জার্মানি তেল কিনলেও লাভবান হচ্ছে ভ্লাদিমির পুতিনের রাশিয়া।',
                'long_description' => 'গত বছরের ২৪ ফেব্রুয়ারির রাশিয়া ও ইউক্রেন যুদ্ধের পর রাশিয়ার তেল আর কিনছে না জার্মানি। তারা এখন তেল নিচ্ছে বর্তমান মধ্য এশিয়া ও সাবেক সোভিয়েত ইউনিয়নের দেশ কাজাখস্তান থেকে। চলতি সপ্তাহেই দ্রুঝবা পাইপলাইন দিয়ে জার্মানিতে তেল পাঠিয়েছে কাজাখস্তান। কাজাখস্তান থেকে জার্মানি তেল কিনলেও লাভবান হচ্ছে ভ্লাদিমির পুতিনের রাশিয়া।

কাজাখস্তান থেকে কেনা তেল যাচ্ছে পূর্ব জার্মানির একটি প্রধান তেল শোধনাগারে। এর আগে এ শোধনাগারে রাশিয়া থেকে আসা অপরিশোধিত তেল পরিশোধন করা হতো। কাজাখস্তান থেকে ২০ হাজার টন (১ লাখ ৪৫ হাজার ব্যারেল) তেল পৌঁছেছে জার্মানিতে। এভাবেই কাজাখস্তান থেকে তেল নিয়ে রাশিয়ার ওপর নির্ভরতা কমানোর চেষ্টা করছে জার্মানি। কিন্তু বাস্তবে সেটা হচ্ছে কি?'
            ],
            4 => [
                 'id' => 5,
                'category_id' => 3,
                'title' => 'তাইওয়ানের কাছে ৬১ কোটি ৯০ লাখ ডলারের যুদ্ধাস্ত্র বিক্রি করছে যুক্তরাষ্ট্র',
                'image' => 'news-5.webp',
                'short_description' => 'তাইওয়ানের কাছে ৬১ কোটি ৯০ লাখ ডলার মূল্যের এফ-১৬ যুদ্ধবিমানের গোলাবারুদ বিক্রির অনুমোদন দিয়েছে যুক্তরাষ্ট্র।',
                'long_description' => 'তাইওয়ানের কাছে ৬১ কোটি ৯০ লাখ ডলার মূল্যের এফ-১৬ যুদ্ধবিমানের গোলাবারুদ বিক্রির অনুমোদন দিয়েছে যুক্তরাষ্ট্র।

গতকাল বুধবার যুক্তরাষ্ট্রের প্রতিরক্ষা সদর দপ্তর পেন্টাগন এ ঘোষণা দেয়। যুক্তরাষ্ট্রের এ পদক্ষেপ চীনকে ক্ষুব্ধ করে তুলতে পারে।

পেন্টাগন এক বিবৃতিতে জানিয়েছে, সমরাস্ত্র বিক্রির এ প্যাকেজের মধ্যে রয়েছে ১০০টি এজিএম-৮৮বি হাইস্পিড অ্যান্টিরেডিয়েশন মিসাইল (এইচএআরএম), ২০০টি এআইএম-১২০ সি-৮ অ্যাডভান্সড মিডিয়াম রেঞ্জ এয়ার-টু-এয়ার মিসাইল (এএমআরএএএম), প্রশিক্ষণের জন্য লঞ্চার ও নকল মিসাইল।'
            ],
            5 => [
                 'id' => 6,
                'category_id' => 3,
                'title' => 'রুহুল কবির রিজভীর মুক্তির দাবিতে রাজশাহী বিশ্ববিদ্যালয়ে সমাবেশ',
                'image' => 'news-6.webp',
                'short_description' => 'বিএনপির সিনিয়র যুগ্ম মহাসচিব ও রাজশাহী বিশ্ববিদ্যালয় কেন্দ্রীয় ছাত্র সংসদের সাবেক সাধারণ সম্পাদক রুহুল কবির রিজভীর মুক্তির দাবিতে রাজশাহী বিশ্ববিদ্যালয়ে ছাত্রদল ছাত্র সমাবেশ করেছে।',
                'long_description' => 'বিএনপির সিনিয়র যুগ্ম মহাসচিব ও রাজশাহী বিশ্ববিদ্যালয় কেন্দ্রীয় ছাত্র সংসদের সাবেক সাধারণ সম্পাদক রুহুল কবির রিজভীর মুক্তির দাবিতে রাজশাহী বিশ্ববিদ্যালয়ে ছাত্রদল ছাত্র সমাবেশ করেছে। আজ বৃহস্পতিবার বেলা ১১টার দিকে বিশ্ববিদ্যালয়ের প্রধান ফটকের সামনে এ সমাবেশ অনুষ্ঠিত হয়। এতে ছাত্রদলের নেতা-কর্মীসহ রাজশাহী জেলা ও মহানগর বিএনপির নেতা-কর্মীরা উপস্থিত ছিলেন। রাজশাহী বিশ্ববিদ্যালয়ের বিএনপিপন্থী শিক্ষকেরা এতে সংহতি জানিয়ে সমাবেশে উপস্থিত ছিলেন।

বিশ্ববিদ্যালয় ছাত্রদল শাখার আহ্বায়ক সুলতান আহমেদের সভাপতিত্বে সমাবেশে প্রধান অতিথি হিসেবে ছিলেন বিএনপির কেন্দ্রীয় কমিটির পরিবেশবিষয়ক সম্পাদক ও সিটি করপোরেশনের সাবেক মেয়র মোসাদ্দেক হোসেন। সমাবেশে প্রধান বক্তা হিসেবে উপস্থিত ছিলেন বিএনপির রাজশাহী বিভাগীয় সহসাংগঠনিক সম্পাদক শাহীন শওকত, রাজশাহী মহানগর বিএনপির সদস্যসচিব মামুন অর রশিদ, জেলা বিএনপির সাবেক সাংগঠনিক সম্পাদক ও বিএনপি জাতীয় নির্বাহী কমিটির সদস্য গোলাম মোস্তফা মামুন প্রমুখ।'
            ],
        ];
    }

    public static function getBlogDetails($id)
    {
        self::$blogs = self::allBlogs();
        foreach (self::$blogs  as $blog)
        {
            if ($blog['id'] == $id)
            {
                return $blog;
            }
        }
    }
}
